Lzw655/esp-bsp/bsp/esp32_s3_lcd_ev_board_v9/src/bsp_lvgl_port.c
//     lv_disp_drv_init(&disp_drv);
// #if CONFIG_BSP_DISPLAY_LVGL_ROTATION_90 || CONFIG_BSP_DISPLAY_LVGL_ROTATION_270
//     disp_drv.hor_res = BSP_LCD_V_RES;
//     disp_drv.ver_res = BSP_LCD_H_RES;
// #else
//     disp_drv.hor_res = BSP_LCD_H_RES;
//     disp_drv.ver_res = BSP_LCD_V_RES;
// #endif
//     disp_drv.flush_cb = flush_callback;
//     disp_drv.drv_update_cb = update_callback;
//     disp_drv.draw_buf = &disp_buf;
//     disp_drv.user_data = lcd;
// #if CONFIG_BSP_DISPLAY_LVGL_FULL_REFRESH
//     disp_drv.full_refresh = 1;
// #elif CONFIG_BSP_DISPLAY_LVGL_DIRECT_MODE
//     disp_drv.direct_mode = 1;
// #endif
    return display;
}

static void touchpad_read(lv_indev_t *indev, lv_indev_data_t *data)
{
    esp_lcd_touch_handle_t tp = (esp_lcd_touch_handle_t)lv_indev_get_user_data(indev);
    assert(tp);

    uint16_t touchpad_x;
    uint16_t touchpad_y;
    uint8_t touchpad_cnt = 0;
    /* Read data from touch controller into memory */
    esp_lcd_touch_read_data(tp);

    /* Read data from touch controller */
    bool touchpad_pressed = esp_lcd_touch_get_coordinates(tp, &touchpad_x, &touchpad_y, NULL, &touchpad_cnt, 1);
    if (touchpad_pressed && touchpad_cnt > 0) {
        data->point.x = touchpad_x;
        data->point.y = touchpad_y;
        data->state = LV_INDEV_STATE_PRESSED;
        ESP_LOGD(TAG, "Touch position: %d,%d", touchpad_x, touchpad_y);
    } else {
        data->state = LV_INDEV_STATE_RELEASED;
    }
}

static lv_indev_t *indev_init(esp_lcd_touch_handle_t tp)
{
    BSP_NULL_CHECK(tp, NULL);

    lv_indev_t *indev = lv_indev_create();
    lv_indev_set_type(indev, LV_INDEV_TYPE_POINTER);   /*See below.*/
    lv_indev_set_user_data(indev, tp);
    lv_indev_set_read_cb(indev, touchpad_read);  /*See below.*/

    return indev;
}

static void tick_increment(void *arg)
{
    /* Tell LVGL how many milliseconds have elapsed */
    lv_tick_inc(LVGL_TICK_PERIOD_MS);
}

static esp_err_t tick_init(void)
{
    // Tick interface for LVGL (using esp_timer to generate 2ms periodic event)
    const esp_timer_create_args_t lvgl_tick_timer_args = {
        .callback = &tick_increment,
        .name = "LVGL tick"
    };
    esp_timer_handle_t lvgl_tick_timer = NULL;
    BSP_ERROR_CHECK_RETURN_ERR(esp_timer_create(&lvgl_tick_timer_args, &lvgl_tick_timer));
    return esp_timer_start_periodic(lvgl_tick_timer, LVGL_TICK_PERIOD_MS * 1000);
}

static void lvgl_port_task(void *arg)
{
    lv_init();
    BSP_ERROR_CHECK_RETURN_ERR(tick_init());
    BSP_NULL_CHECK(disp = display_init(lcd), ESP_FAIL);
    BSP_NULL_CHECK(indev = indev_init(tp), ESP_FAIL);

#if CONFIG_BSP_DISPLAY_LVGL_ROTATION_90
    esp_lcd_touch_set_swap_xy(tp, true);
    esp_lcd_touch_set_mirror_y(tp, true);
#elif CONFIG_BSP_DISPLAY_LVGL_ROTATION_180
    esp_lcd_touch_set_mirror_x(tp, true);
    esp_lcd_touch_set_mirror_y(tp, true);
#elif CONFIG_BSP_DISPLAY_LVGL_ROTATION_270
    esp_lcd_touch_set_swap_xy(tp, true);
    esp_lcd_touch_set_mirror_x(tp, true);
#endif

    ESP_LOGI(TAG, "Starting LVGL task");
    while (1) {
        bsp_display_lock(0);
        uint32_t task_delay_ms = lv_timer_handler();
        bsp_display_unlock();
        if (task_delay_ms > 500) {
            task_delay_ms = 500;
        } else if (task_delay_ms < CONFIG_BSP_DISPLAY_LVGL_TASK_DELAY) {
            task_delay_ms = CONFIG_BSP_DISPLAY_LVGL_TASK_DELAY;
        }
        vTaskDelay(pdMS_TO_TICKS(task_delay_ms));
    }
}

esp_err_t bsp_lvgl_port_init(esp_lcd_panel_handle_t lcd_in, esp_lcd_touch_handle_t tp_in, lv_display_t **disp_out, lv_indev_t **indev_out)
{
    BSP_NULL_CHECK(lcd_in, ESP_ERR_INVALID_ARG);
    BSP_NULL_CHECK(tp_in, ESP_ERR_INVALID_ARG);
    BSP_NULL_CHECK(disp_out, ESP_ERR_INVALID_ARG);
    BSP_NULL_CHECK(indev_out, ESP_ERR_INVALID_ARG);

    lcd = lcd_in;
    tp = tp_in;

    lvgl_mux = xSemaphoreCreateRecursiveMutex();
    BSP_NULL_CHECK(lvgl_mux, ESP_FAIL);
    ESP_LOGI(TAG, "Create LVGL task");
    BaseType_t core_id = (CONFIG_BSP_DISPLAY_LVGL_TASK_CORE_ID < 0) ? tskNO_AFFINITY : CONFIG_BSP_DISPLAY_LVGL_TASK_CORE_ID;
    BaseType_t ret = xTaskCreatePinnedToCore(
                         lvgl_port_task, "LVGL", CONFIG_BSP_DISPLAY_LVGL_TASK_STACK_SIZE_KB * 1024, NULL,
                         CONFIG_BSP_DISPLAY_LVGL_TASK_PRIORITY, &lvgl_task_handle, core_id
                     );
    if (ret != pdPASS) {
        ESP_LOGE(TAG, "Failed to create LVGL task");
        return ESP_FAIL;
    }
#if CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR
    bsp_display_register_trans_done_callback(lcd_trans_done);
#endif

    vTaskDelay(pdMS_TO_TICKS(1000));

    *disp_out = disp;
    *indev_out = indev;

    return ESP_OK;
}

bool bsp_lvgl_port_lock(uint32_t timeout_ms)
{
    assert(lvgl_mux && "bsp_lvgl_port_init must be called first");

    const TickType_t timeout_ticks = (timeout_ms == 0) ? portMAX_DELAY : pdMS_TO_TICKS(timeout_ms);
    return xSemaphoreTakeRecursive(lvgl_mux, timeout_ticks) == pdTRUE;
}

void bsp_lvgl_port_unlock(void)
{
    assert(lvgl_mux && "bsp_lvgl_port_init must be called first");
    xSemaphoreGiveRecursive(lvgl_mux);
}
